import { cutVideo } from "./components/video.js";

/*
 * v : videoIndex 비디오번호
 * t : seekTime 시간
 * g : game 게임
 * q : quater 쿼터
 * s : scorers 득점선수명
 * a : assist player 어시선수명
 * k : skill 스킬이름
 */
const SKILL = {
  TP: "3점슛",
  FB: "풋백",
  FT: "자유투",
  SM: "스핀무브",
  BC: "바스켓카운트",
  FA: "페이드어웨이",
  RG: "속공",
};

await cutVideo({
  gameInfo: {
    title: "GBA",
    date: "20230902",
    place: "영등포 제2스포츠센터",
  },
  bgmPath: "assets/Flying.mp3",
  videoPath: [
    "_input/gba_20230902_1.mp4",
    "_input/gba_20230902_2.mp4",
    "_input/gba_20230902_3.mp4",
  ],
  seekArr: [
    {
      v: 0,
      g: 1,
      q: 1,
      t: "01:13",
      s: "김영재",
      a: "황지환",
    },
    { v: 0, g: 1, q: 1, t: "05:13", s: "김영재", a: "황지환" },
    { v: 0, g: 1, q: 1, t: "08:45", s: "김영재", a: "이도연", k: SKILL.TP },
    { v: 0, g: 1, q: 1, t: "09:45", s: "이도연", k: SKILL.FB },
    { v: 0, g: 1, q: 2, t: "12:44", s: "황지환", a: "유민호" },
    { v: 0, g: 1, q: 2, t: "13:18", s: "이도연", a: "유민호" },
    { v: 0, g: 1, q: 2, t: "14:35", s: "이도연", a: "황지환" },
    { v: 0, g: 1, q: 2, t: "16:38", s: "황지환" },
    { v: 0, g: 1, q: 2, t: "17:19", s: "이도연", k: SKILL.FB },
    { v: 0, g: 1, q: 2, t: "17:48", s: "황지환", k: SKILL.FB },
    { v: 0, g: 1, q: 2, t: "18:32", s: "황지환", k: SKILL.FB },
    { v: 0, g: 1, q: 2, t: "19:07", s: "황지환", k: SKILL.FB },
    { v: 0, g: 1, q: 2, t: "21:50", s: "유민호", k: SKILL.FT },
    { v: 0, g: 1, q: 3, t: "25:07", s: "김영재", a: "유민호", k: SKILL.TP },
    { v: 0, g: 1, q: 3, t: "28:44", s: "이도연", a: "최진홍" },
    { v: 0, g: 1, q: 3, t: "29:20", s: "유민호", a: "김영재" },
    { v: 0, g: 1, q: 3, t: "29:40", s: "최광오", a: "이도연" },
    { v: 0, g: 1, q: 3, t: "31:18", s: "최진홍", k: SKILL.FT },
    { v: 0, g: 1, q: 3, t: "32:50", s: "이도연", a: "최광오" },
    { v: 0, g: 1, q: 3, t: "33:48", s: "유민호" },
    { v: 0, g: 1, q: 4, t: "38:08", s: "황지환", a: "최광오", k: SKILL.SM },
    { v: 0, g: 1, q: 4, t: "39:00", s: "황지환", k: "풋백" },
    { v: 0, g: 1, q: 4, t: "39:33", s: "황지환", k: SKILL.FT },
    { v: 0, g: 1, q: 4, t: "40:07", s: "김영재" },
    { v: 0, g: 1, q: 4, t: "40:49", s: "최진홍", a: "최광오" },
    { v: 0, g: 1, q: 4, t: "43:36", s: "최진홍", a: "이재욱" },
    { v: 0, g: 1, q: 4, t: "44:01", s: "김영재", a: "최광오" },
    { v: 0, g: 1, q: 4, t: "45:31", s: "황지환" },
    { v: 0, g: 1, q: 4, t: "46:01", s: "김영재", a: "최광오" },
    { v: 1, g: 2, q: 1, t: "02:06", s: "최광오", a: "황지환" },
    { v: 1, g: 2, q: 1, t: "03:47", s: "이재욱", a: "최광오" },
    { v: 1, g: 2, q: 1, t: "04:03", s: "황지환" },
    { v: 1, g: 2, q: 1, t: "05:29", s: "이재욱", a: "최광오", k: SKILL.TP },
    { v: 1, g: 2, q: 1, t: "06:05", s: "황지환", a: "최광오" },
    { v: 1, g: 2, q: 1, t: "08:35", s: "이재욱", k: SKILL.FT },
    { v: 1, g: 2, q: 1, t: "09:48", s: "이도연", a: "황지환", k: SKILL.BC },
    { v: 1, g: 2, q: 1, t: "10:33", s: "이도연", a: "황지환" },
    { v: 1, g: 2, q: 2, t: "13:33", s: "황지환", a: "유민호", k: SKILL.FA },
    { v: 1, g: 2, q: 2, t: "14:40", s: "이도연", a: "최진홍" },
    { v: 1, g: 2, q: 2, t: "15:35", s: "이도연", k: SKILL.FB },
    { v: 1, g: 2, q: 2, t: "16:37", s: "이도연", a: "김영재" },
    { v: 1, g: 2, q: 2, t: "17:43", s: "황지환", a: "최진홍" },
    { v: 1, g: 2, q: 2, t: "18:27", s: "이도연", a: "최진홍" },
    { v: 1, g: 2, q: 2, t: "18:53", s: "황지환", a: "최진홍" },
    { v: 1, g: 2, q: 2, t: "19:44", s: "최진홍" },
    { v: 1, g: 2, q: 2, t: "20:32", s: "황지환", a: "최진홍", k: SKILL.BC },
    { v: 1, g: 2, q: 2, t: "22:04", s: "김영재", a: "유민호", k: SKILL.TP },
    { v: 1, g: 2, q: 2, t: "22:37", s: "유민호", a: "최진홍" },
    { v: 2, g: 2, q: 3, t: "02:16", s: "유민호", a: "최진홍", k: SKILL.SM },
    { v: 2, g: 2, q: 3, t: "03:00", s: "이재욱", a: "최진홍" },
    { v: 2, g: 2, q: 3, t: "04:46", s: "김영재", a: "최진홍" },
    { v: 2, g: 2, q: 3, t: "10:06", s: "유민호", a: "이재욱" },
    { v: 2, g: 2, q: 4, t: "14:46", s: "황지환", k: SKILL.BC },
    { v: 2, g: 2, q: 4, t: "16:08", s: "황지환", a: "이도연" },
    { v: 2, g: 2, q: 4, t: "16:53", s: "김영재" },
    { v: 2, g: 2, q: 4, t: "17:33", s: "황지환", a: "이재욱" },
    { v: 2, g: 2, q: 4, t: "18:41", s: "이재욱", k: SKILL.FB },
    { v: 2, g: 2, q: 4, t: "20:32", s: "이재욱", a: "황지환", k: SKILL.RG },
    { v: 2, g: 2, q: 4, t: "22:10", s: "이도연", k: "풋백" },
    { v: 2, g: 2, q: 4, t: "22:54", s: "이재욱", a: "최광오" },
  ],
});
